--- a/Readme.md
+++ b/Readme.md
@@ -258,217 +264,195 @@ Voici le rendu final de l'éditeur v1:
-SelectRightCommand "1" *--> "editor 1" Editor 
-```
-ou le diagrame la ?
+```plantuml
+@startuml
 
-```mermaid
-classDiagram
-direction BT
+!theme plain
+top to bottom direction
+skinparam linetype ortho
+
 class CharacterReleaseCommand {
-  + execute() void
-  + toString() String
+  + execute(): void
+  + toString(): String
 }
-class Command {
-<<Interface>>
-  + execute() void
+interface Command << interface >> {
+  + execute(): void
 }
 class CopyCommand {
-  + getInstance(Editor) CopyCommand
-  + execute() void
+  + execute(): void
+  + getInstance(Editor): CopyCommand
 }
 class CutCommand {
-  + getInstance(Editor) CutCommand
-  + execute() void
+  + execute(): void
+  + getInstance(Editor): CutCommand
 }
 class Editor {
-  - JTextArea textArea
-  - String copyBuffer
-   String selectedTextText
-   String copyBuffer
-   JTextArea textArea
+   selectedTextText: String
+   copyBuffer: String
+   textArea: JTextArea
 }
 class HistoryCommand {
-  - int currentId
-  - HistoryCommand instance
-  - Stack~Pair~Command, String~~ historicStack
-  + replay() Pair~Command, String~
-  + push(Pair~Command, String~) void
-  + toString() String
-  + redo() Pair~Command, String~?
-  + undo() Pair~Command, String~?
-  + pop() Pair~Command, String~
-   boolean empty
-   Stack~Pair~Command, String~~ historicStack
-   HistoryCommand instance
-   int currentId
+  + toString(): String
+  + pop(): Pair<Command, String>
+  + replay(): Pair<Command, String>
+  + push(Pair<Command, String>): void
+  + undo(): Pair<Command, String>?
+  + redo(): Pair<Command, String>?
+   currentId: int
+   historicStack: Stack<Pair<Command, String>>
+   empty: boolean
+   instance: HistoryCommand
 }
 class MainEditor {
-  + main(String[]) void
+  + main(String[]): void
 }
-class Pair~K, V~ {
-  - K key
-  - V value
-   V value
-   K key
+class Pair<K, V> {
+   value: V
+   key: K
 }
 class PasteCommand {
-  + getInstance(Editor) PasteCommand
-  + execute() void
+  + getInstance(Editor): PasteCommand
+  + execute(): void
 }
 class SelectLeftCommand {
-  + getInstance(Editor) SelectLeftCommand
-  + execute() void
+  + getInstance(Editor): SelectLeftCommand
+  + execute(): void
 }
 class SelectRightCommand {
-  + getInstance(Editor) SelectRightCommand
-  + execute() void
+  + execute(): void
+  + getInstance(Editor): SelectRightCommand
 }
 
-CharacterReleaseCommand  ..>  Command 
-CharacterReleaseCommand "1" *--> "editor 1" Editor 
-CopyCommand  ..>  Command 
-CopyCommand "1" *--> "editor 1" Editor 
-CutCommand  ..>  Command 
-CutCommand "1" *--> "editor 1" Editor 
-Editor  ..>  CharacterReleaseCommand : «create»
-Editor "1" *--> "historyCommand 1" HistoryCommand 
-Editor  ..>  Pair~K, V~ : «create»
-HistoryCommand  ..>  CharacterReleaseCommand : «create»
-HistoryCommand  ..>  Pair~K, V~ : «create»
-MainEditor  ..>  Editor : «create»
-PasteCommand  ..>  Command 
-PasteCommand "1" *--> "editor 1" Editor 
-SelectLeftCommand  ..>  Command 
-SelectLeftCommand "1" *--> "editor 1" Editor 
-SelectRightCommand  ..>  Command 
-SelectRightCommand "1" *--> "editor 1" Editor 
+CharacterReleaseCommand  -[#008200,dashed]-^  Command   
+CharacterReleaseCommand "1" *-[#595959,plain]-> Editor  
+CopyCommand              -[#008200,dashed]-^  Command   
+CopyCommand             "1" *-[#595959,plain]->  Editor  
+CutCommand               -[#008200,dashed]-^  Command   
+CutCommand              "1" *-[#595959,plain]->  Editor  
+Editor                   -[#595959,dashed]->  CharacterReleaseCommand : "«create»"
+Editor                  "1" *-[#595959,plain]-> "historyCommand\n1" HistoryCommand  
+Editor                   -[#595959,dashed]->  Pair                    : "«create»"
+HistoryCommand           -[#595959,dashed]->  CharacterReleaseCommand : "«create»"
+HistoryCommand           -[#595959,dashed]->  Pair                    : "«create»"
+MainEditor               -[#595959,dashed]->  Editor                  : "«create»"
+PasteCommand             -[#008200,dashed]-^  Command   
+PasteCommand            "1" *-[#595959,plain]-> Editor  
+SelectLeftCommand        -[#008200,dashed]-^  Command   
+SelectLeftCommand       "1" *-[#595959,plain]-> Editor  
+SelectRightCommand       -[#008200,dashed]-^  Command   
+SelectRightCommand      "1" *-[#595959,plain]-> Editor  
+@enduml
 
 ```
-Le diagramme de class de la version 2 est le même que celui de la version 1. Nous ajoutons donc les classes énoncés précédemment.
+
+Le diagramme de class de la version 2 est le même que celui de la version 1. Nous allons y ajouter les classes présenté précédemment.
